In [1]:
import pandas as pd
import numpy as np

np.random.seed(123)

from env import host, user, password

In [2]:
def get_db_url(database):
    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
    return url


# pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', get_db_url('employees'))

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [3]:
# 5. Once you have successfully run a query:
# a. Intentionally make a typo in the database url. What kind of error message do you see?
# timeout error
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', 'mysql+pymysql://user:password@123.123.123.123/employees')

OperationalError: (pymysql.err.OperationalError) (2003, "Can't connect to MySQL server on '123.123.123.123' (timed out)")
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [ ]:
# Intentionally make an error in your SQL query. What does the error message look like?
# SQL syntax error
pd.read_sql('SELEC * FROM employees LIMIT 5 OFFSET 50', get_db_url('employees'))

In [ ]:
# 6. Read the employees and titles tables into two separate DataFrames.
employees = pd.read_sql('SELECT * FROM employees', get_db_url('employees'))
titles = pd.read_sql('SELECT * FROM titles', get_db_url('employees'))

In [ ]:
employees

In [ ]:
titles

In [ ]:
# 7. How many rows and columns do you have in each DataFrame? Is that what you expected?
# employees: 6 columns, 300023 rows
# titles: 4 columns, 443307 rows
employees.info()
titles.info()
employees.shape
titles.shape

In [ ]:
# Display the summary statistics for each DataFrame.
employees.describe()
titles.describe()

In [ ]:
# How many unique titles are in the titles DataFrame?
# 7
titles.title.value_counts()

In [ ]:
# What is the oldest date in the to_date column?
titles.to_date.sort_values(ascending = True).head(1)

In [ ]:
# What is the most recent date in the to_date column?
# 2002-08-01
from datetime import date
titles[titles.to_date <= date.today()].sort_values(by='to_date', ascending=False)

# Exercises II

1. Copy the users and roles DataFrames from the examples above

In [4]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [5]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

2. What is the result of using a right join on the DataFrames?

In [6]:
join_right = users.merge(roles, left_on='role_id', right_on='id', how='right', indicator=True)

In [7]:
join_right

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

3. What is the result of using an outer join on the DataFrames?

In [ ]:
join_outer = users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)
join_outer

4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [ ]:
# nonsense
users.drop(columns='role_id')
users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)

Load the mpg dataset from PyDataset.

In [24]:
from pydataset import data
mpg = data('mpg', show_doc = True)
mpg = data('mpg')
mpg.head()

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

6. Output and read the documentation for the mpg dataset.

In [ ]:
mpg.info()

In [26]:
rows, columns = mpg.shape
print(f'{rows} rows, {columns} columns')

234 rows, 11 columns

In [ ]:
# 234 rows × 11 columns
mpg

8. Check out your column names and perform any cleanup you may want on them.

In [9]:
mpg.fl.unique()

array(['p', 'r', 'e', 'd', 'c'], dtype=object)

10. How many different manufacturers are there?

In [10]:
mpg.manufacturer.unique()
mpg.manufacturer.nunique()

15

11. How many different models are there?

In [11]:
mpg.model.nunique()

38

12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [12]:
mpg['mileage_difference'] = mpg.hwy - mpg.cty
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [28]:
mpg['average_mileage'] = (mpg.cty + mpg.hwy)/2
mpg['average_mileage_2'] = mpg[['cty', 'hwy']].mean(axis=1)
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,average_mileage,average_mileage_2
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,23.5,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,25.0,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,21.0,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,22.0,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,21.5,21.5

14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [35]:
mpg['is_automatic'] = np.where(mpg.trans.str.find('auto') == 0, 'yes', 'no')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,average_mileage,average_mileage_2,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,23.5,yes
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,25.0,no
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,25.5,no
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,25.5,yes
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,21.0,yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,23.5,23.5,yes
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,25.0,25.0,no
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,21.0,21.0,yes
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,22.0,22.0,no
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,21.5,21.5,yes

15. Using the mpg dataset, find out which manufacturer has the best miles per gallon on average?

In [31]:
mpg.groupby('manufacturer').average_mileage.mean().idxmax()
# honda

'honda'

16. Do automatic or manual cars have better miles per gallon?

In [37]:
mpg.groupby('is_automatic').average_mileage.mean()

is_automatic
no     22.227273
yes    19.130573
Name: average_mileage, dtype: float64

In [2]:
# manual

# Exercises III

1. Use your get_db_url function to help you explore the data from the chipotle database.

In [6]:
def get_db_url(database):
    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
    return url
chipotle_tables = pd.read_sql('SHOW TABLES', get_db_url('chipotle'))
chipotle_tables

  Tables_in_chipotle
0             orders

In [7]:
orders = pd.read_sql('Select * FROM orders', get_db_url('chipotle'))
orders

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

2. What is the total price for each order?

In [18]:

def string_to_float(b):
    b = b.replace('$', '') # Replaces '$' with an empty space ''.
    b = float(b)
    return b
#orders['total_price'] = orders.item_price.apply(string_to_float) * orders.quantity
#orders

orders.groupby('order_id').total_price.sum()

order_id
1       11.56
2       33.96
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: total_price, Length: 1834, dtype: float64

What are the most popular 3 items?

In [40]:
items_by_quantity = pd.crosstab(orders.item_name, orders.quantity, margins=True)
items_by_quantity.sort_values(by='All', ascending=False).head()
# chicken bowl, chicken burrito, chips and guacamole

quantity                1    2   3   4  5  7  8  10  15   All
item_name
All                  4355  224  28  10  1  1  1   1   1  4622
Chicken Bowl          693   31   2   0  0  0  0   0   0   726
Chicken Burrito       521   28   2   2  0  0  0   0   0   553
Chips and Guacamole   455   22   1   1  0  0  0   0   0   479
Steak Burrito         352   14   2   0  0  0  0   0   0   368

4. Which item has produced the most revenue?

In [44]:
orders.groupby('item_name').total_price.sum().sort_values(ascending=False).head()
# Chicken bowl

item_name
Chicken Bowl           8044.63
Chicken Burrito        6387.06
Steak Burrito          4236.13
Steak Bowl             2479.81
Chips and Guacamole    2475.62
Name: total_price, dtype: float64

5. Join the employees and titles DataFrames together.

In [45]:
employees = pd.read_sql('select * from employees', get_db_url('employees'))
titles = pd.read_sql('select * from titles', get_db_url('employees'))
employees

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [46]:
titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [48]:
e_and_t = pd.merge(employees, titles, on='emp_no')
e_and_t

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

6. For each title, find the hire date of the employee that was hired most recently with that title.

In [49]:
e_and_t.groupby('title').hire_date.max()

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [50]:
departments = pd.read_sql('select * from departments', get_db_url('employees'))
dept_emp = pd.read_sql('select * from dept_emp', get_db_url('employees'))
d_and_d = pd.merge(departments, dept_emp, on='dept_no')
d_and_d

       dept_no         dept_name  emp_no   from_date     to_date
0         d009  Customer Service   10011  1990-01-22  1996-11-09
1         d009  Customer Service   10038  1989-09-20  9999-01-01
2         d009  Customer Service   10049  1992-05-04  9999-01-01
3         d009  Customer Service   10060  1992-11-11  9999-01-01
4         d009  Customer Service   10088  1992-03-21  9999-01-01
...        ...               ...     ...         ...         ...
331598    d007             Sales  499976  1988-12-26  9999-01-01
331599    d007             Sales  499980  1991-02-11  9999-01-01
331600    d007             Sales  499986  1985-08-11  9999-01-01
331601    d007             Sales  499987  1999-12-21  9999-01-01
331602    d007             Sales  499988  1988-07-25  2001-10-09

[331603 rows x 5 columns]

In [51]:
pd.crosstab(e_and_t.title, d_and_d.dept_name)

dept_name,Customer Service,Development,Finance,Human Resources,Marketing,Production,Quality Management,Research,Sales
title,,,,,,,,,
Assistant Engineer,822,2941,631,593,716,2418,716,719,1852
Engineer,6170,22290,4494,4554,5224,19016,5200,5525,13568
Manager,0,0,0,0,24,0,0,0,0
Senior Engineer,5175,19014,3820,3841,4449,16180,4457,4682,11445
Senior Staff,4855,17887,3609,3809,4299,15475,4185,4367,10953
Staff,5734,20611,4205,4383,4824,17847,4859,5141,12652
Technique Leader,824,2964,587,606,675,2549,700,692,1775